In [26]:
import pandas as pd
import numpy as np
import re
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams['figure.figsize'] = (20,10)

In [27]:
df1 = pd.read_csv('apartments.csv')
df1.head()
# df1.count()

,Unnamed: 0,title,location,bedrooms,bathrooms,price,rate
0,0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000,Per Month
1,1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000,Per Month
2,2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000,Per Month
3,3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000,Per Month
4,4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000,Per Month

In [28]:
df_k = pd.read_csv('rent_apts.csv')
df_k.head()
# df_k.count()

,Agency,Neighborhood,Price,link,sq_mtrs,Bedrooms,Bathrooms
0,Buy Rent Shelters,"General Mathenge, Westlands","KSh 155,000",/listings/4-bedroom-apartment-for-rent-general...,4.0,4.0,4.0
1,Kenya Classic Homes,"Kilimani, Dagoretti North","KSh 100,000",/listings/3-bedroom-apartment-for-rent-kiliman...,300.0,3.0,4.0
2,Absolute Estate Agents,"Hatheru Rd,, Lavington, Dagoretti North","KSh 75,000",/listings/3-bedroom-apartment-for-rent-lavingt...,3.0,3.0,5.0
3,A1 Properties Limited,"Kilimani, Dagoretti North","KSh 135,000",/listings/3-bedroom-apartment-for-rent-kiliman...,227.0,3.0,4.0
4,Pmc Estates Limited,"Imara Daima, Embakasi","KSh 50,000",/listings/3-bedroom-apartment-for-rent-imara-d...,3.0,3.0,NaN

In [29]:
df1.shape

(2520, 7)

In [30]:
df2 = df1.drop(['Unnamed: 0','title', 'rate'], axis='columns')
df2.shape

(2520, 4)

In [31]:
df_2 = df_k.drop(['Agency','link', 'sq_mtrs'], axis='columns')
df_2.shape

(1848, 4)

In [32]:
df2.head()

                                   location  bedrooms  bathrooms     price
0  Riverside Dr Nairobi, Riverside, Nairobi         3          3   200 000
1                       Kileleshwa, Nairobi         3          4    70 000
2          Links Rd Mombasa, Nyali, Mombasa         3          2    38 000
3    Near Valley Arcade, Lavington, Nairobi         3          3    80 000
4                       Kileleshwa, Nairobi         1          1   110 000

In [33]:
df_2.head()

                              Neighborhood        Price  Bedrooms  Bathrooms
0              General Mathenge, Westlands  KSh 155,000       4.0        4.0
1                Kilimani, Dagoretti North  KSh 100,000       3.0        4.0
2  Hatheru Rd,, Lavington, Dagoretti North   KSh 75,000       3.0        5.0
3                Kilimani, Dagoretti North  KSh 135,000       3.0        4.0
4                    Imara Daima, Embakasi   KSh 50,000       3.0        NaN

In [34]:
df2.isnull().sum()

location     376
bedrooms       0
bathrooms      0
price          0
dtype: int64

In [35]:
df_2.isnull().sum()

Neighborhood      0
Price             0
Bedrooms          3
Bathrooms       291
dtype: int64

In [37]:
df3 = df2.dropna()
df3.isnull().sum()

location     0
bedrooms     0
bathrooms    0
price        0
dtype: int64

In [38]:
df_3 = df_2.dropna()
df_3.isnull().sum()

Neighborhood    0
Price           0
Bedrooms        0
Bathrooms       0
dtype: int64

In [39]:
df3.shape

(2144, 4)

In [40]:
df_3.shape

(1557, 4)

In [41]:
df3['bathrooms'].unique()

array([3, 4, 2, 1, 5], dtype=int64)

In [42]:
df_3['Bathrooms'].unique()

array([4., 5., 3., 2., 1., 6.])

In [43]:
df3['price'] = df3['price'].apply(lambda x: int(re.sub('(?<=\d) (?=\d)', '', x)))

C:\Users\steph\AppData\Local\Temp/ipykernel_8348/3377964079.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['price'] = df3['price'].apply(lambda x: int(re.sub('(?<=\d) (?=\d)', '', x)))

In [44]:
df_3['Price'] = df_3['Price'].apply(lambda x: int((x.split(' ')[1]).replace(',','')))

C:\Users\steph\AppData\Local\Temp/ipykernel_8348/2401036803.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_3['Price'] = df_3['Price'].apply(lambda x: int((x.split(' ')[1]).replace(',','')))

In [45]:
df3.head()

                                   location  bedrooms  bathrooms   price
0  Riverside Dr Nairobi, Riverside, Nairobi         3          3  200000
1                       Kileleshwa, Nairobi         3          4   70000
2          Links Rd Mombasa, Nyali, Mombasa         3          2   38000
3    Near Valley Arcade, Lavington, Nairobi         3          3   80000
4                       Kileleshwa, Nairobi         1          1  110000

In [46]:
df_3.head()

                                 Neighborhood   Price  Bedrooms  Bathrooms
0                 General Mathenge, Westlands  155000       4.0        4.0
1                   Kilimani, Dagoretti North  100000       3.0        4.0
2     Hatheru Rd,, Lavington, Dagoretti North   75000       3.0        5.0
3                   Kilimani, Dagoretti North  135000       3.0        4.0
6  Off Denis Pritt, Kilimani, Dagoretti North  100000       2.0        3.0

In [47]:
df3['bedrooms'].unique()

array([3, 1, 4, 2], dtype=int64)

In [48]:
df_3['Bedrooms'].unique()

array([4., 3., 2., 1., 0., 5., 6.])

In [49]:
df3[df3['bedrooms'] == 1]

                 location  bedrooms  bathrooms   price
4     Kileleshwa, Nairobi         1          1  110000
8          Nyali, Mombasa         1          1    5000
10         Nyali, Mombasa         1          1    5000
13        Shanzu, Mombasa         1          1   55000
25    Kileleshwa, Nairobi         1          1  110000
...                   ...       ...        ...     ...
2488       Nyali, Mombasa         1          1    5000
2491      Shanzu, Mombasa         1          1   55000
2503  Kileleshwa, Nairobi         1          1  110000
2508       Nyali, Mombasa         1          1    5000
2511      Shanzu, Mombasa         1          1   55000

[381 rows x 4 columns]

In [50]:
df_3[df_3['Bedrooms'] == 1]

,Neighborhood,Price,Bedrooms,Bathrooms
13,"Riverside, Westlands",85000,1.0,1.0
18,"nyali road, nyali road, Nyali Area, Nyali",12000,1.0,1.0
22,"fisharies, mtambo bamburi road, Bamburi, Kisauni",13000,1.0,1.0
25,"Uthiru 87, Waiyaki Way, Uthiru/Ruthimitu, Dago...",15000,1.0,1.0
29,"Kasarani Area, Kasarani",16000,1.0,1.0
...,...,...,...,...
1728,"Westlands Area, Westlands",160000,1.0,1.0
1730,"Westlands Area, Westlands",160000,1.0,1.0
1757,"Waiyaki Way, Westlands",160000,1.0,2.0
1806,"Kilimani, Dagoretti North",170000,1.0,1.0
1839,"Westlands Area, Westlands",180000,1.0,2.0

In [51]:
len(df3.location.unique())

17

In [52]:
len(df_3.Neighborhood.unique())

598

In [53]:
location_stats = df3.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats

location
Kileleshwa, Nairobi                                      257
Westlands, Nairobi                                       252
Kilimani, Nairobi                                        251
Shanzu, Mombasa                                          129
Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu              128
Westlands downtown, Westlands, Nairobi                   127
Links Rd Mombasa, Nyali, Mombasa                         126
Muthaiga, Nairobi                                        126
Riverside Dr Nairobi, Riverside, Nairobi                 125
Thika Rd Nairobi, Kahawa Wendani, Nairobi                125
Grevillea Grove Spring Valley, Spring Valley, Nairobi    125
Nyali, Mombasa                                           125
Kileleshwa Nairobi, Kileleshwa, Nairobi                  125
Vihiga road, Kileleshwa, Nairobi                          56
Near Valley Arcade, Lavington, Nairobi                    35
Off Othaya road, Lavington, Nairobi                       20
Jabavu court, Kilimani, Nairobi                           12
Name: location, dtype: int64

In [54]:
location_stats2 = df_3.groupby('Neighborhood')['Neighborhood'].agg('count').sort_values(ascending=False)
location_stats2

Neighborhood
Kilimani, Dagoretti North                              125
Westlands Area, Westlands                               87
Kileleshwa, Dagoretti North                             73
Lavington, Dagoretti North                              71
Riverside, Westlands                                    43
                                                      ...
Kilimani, Riara road, Riara Road, Dagoretti North        1
Kileleshwa, Kileleshwa, Kileleshwa, Dagoretti North      1
Kikambala, Kileleshwa, Dagoretti North                   1
Kikambala Road, Kileleshwa, Dagoretti North              1
westlands, Westlands, Riverside, Westlands               1
Name: Neighborhood, Length: 598, dtype: int64

In [55]:
df3.price.describe()

count      2144.000000
mean      93363.689366
std       68227.778336
min        5000.000000
25%       55000.000000
50%       70000.000000
75%      100000.000000
max      300000.000000
Name: price, dtype: float64

In [56]:
df_3.Price.describe()

count      1557.000000
mean      98339.751445
std       40175.785665
min       12000.000000
25%       70000.000000
50%       95000.000000
75%      130000.000000
max      240000.000000
Name: Price, dtype: float64

In [57]:
df_3.columns = ['location', 'price', 'bedrooms', 'bathrooms']

In [58]:
df_3.head()

                                     location   price  bedrooms  bathrooms
0                 General Mathenge, Westlands  155000       4.0        4.0
1                   Kilimani, Dagoretti North  100000       3.0        4.0
2     Hatheru Rd,, Lavington, Dagoretti North   75000       3.0        5.0
3                   Kilimani, Dagoretti North  135000       3.0        4.0
6  Off Denis Pritt, Kilimani, Dagoretti North  100000       2.0        3.0

In [61]:
df_3.shape

(1557, 4)

In [62]:
df3.shape

(2144, 4)

In [63]:
df_new = pd.merge(df3, df_3, how='outer', on=['location', 'price', 'bedrooms','bathrooms'])

In [64]:
df_new.shape

(3701, 4)

In [65]:
df_new.head()

                                   location  bedrooms  bathrooms   price
0  Riverside Dr Nairobi, Riverside, Nairobi       3.0        3.0  200000
1  Riverside Dr Nairobi, Riverside, Nairobi       3.0        3.0  200000
2  Riverside Dr Nairobi, Riverside, Nairobi       3.0        3.0  200000
3  Riverside Dr Nairobi, Riverside, Nairobi       3.0        3.0  200000
4  Riverside Dr Nairobi, Riverside, Nairobi       3.0        3.0  200000

In [66]:
df_new.describe()

          bedrooms    bathrooms          price
count  3701.000000  3701.000000    3701.000000
mean      2.558228     2.523102   95457.104296
std       0.911889     1.024468   58146.117378
min       0.000000     1.000000    5000.000000
25%       2.000000     2.000000   57750.000000
50%       3.000000     2.000000   75000.000000
75%       3.000000     3.000000  120000.000000
max       6.000000     6.000000  300000.000000

In [71]:
location_stats_new=df_new.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats_new

location
Kileleshwa, Nairobi                                  257
Westlands, Nairobi                                   252
Kilimani, Nairobi                                    251
Shanzu, Mombasa                                      129
Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu          128
                                                    ...
Kindaruma rd, Kilimani, Dagoretti North                1
Kindaruma Rd , Kilimani, Dagoretti North               1
Kindaruma , Kilimani, Dagoretti North                  1
Kilimani, Riara road, Riara Road, Dagoretti North      1
westlands, Westlands, Riverside, Westlands             1
Name: location, Length: 615, dtype: int64

In [72]:
len(location_stats_new[location_stats_new <= 10])

580

In [74]:
location_stats_less_than_10 = location_stats_new[location_stats_new<10]
location_stats_less_than_10

location
kileleshwa, Kileleshwa, Kileleshwa, Dagoretti North    9
Mandera Road, Kileleshwa, Dagoretti North              9
Dennis Pritt, Kilimani, Dagoretti North                8
Riara Rd, Lavington, Dagoretti North                   8
Loresho, Westlands                                     8
                                                      ..
Kindaruma rd, Kilimani, Dagoretti North                1
Kindaruma Rd , Kilimani, Dagoretti North               1
Kindaruma , Kilimani, Dagoretti North                  1
Kilimani, Riara road, Riara Road, Dagoretti North      1
westlands, Westlands, Riverside, Westlands             1
Name: location, Length: 577, dtype: int64

In [75]:
df_new.location = df_new.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)
len(df_new.location.unique())

39

In [76]:
dummies = pd.get_dummies(df_new.location)
dummies

,"Brookside, Westlands","General Mathenge, General Mathenge, Westlands","General Mathenge, Westlands","Grevillea Grove Spring Valley, Spring Valley, Nairobi","Jabavu court, Kilimani, Nairobi","Kiambu Road, Kiambu Road","Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu","Kileleshwa Nairobi, Kileleshwa, Nairobi","Kileleshwa, Dagoretti North","Kileleshwa, Nairobi",...,"Thika Rd Nairobi, Kahawa Wendani, Nairobi","Vihiga road, Kileleshwa, Nairobi","Waiyaki Way, Westlands","Westlands Area, Westlands","Westlands downtown, Westlands, Nairobi","Westlands, Nairobi","kilimani, Kilimani, Kilimani, Dagoretti North","kilimani, kilimani, Kilimani, Dagoretti North","lavington, Lavington, Lavington, Dagoretti North",other
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3696,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
3697,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3698,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
3699,0,0,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3700,0,0,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0

In [77]:
df_new2 = pd.concat([df_new, dummies.drop('other', axis='columns')], axis='columns')
df_new2.head()

,location,bedrooms,bathrooms,price,"Brookside, Westlands","General Mathenge, General Mathenge, Westlands","General Mathenge, Westlands","Grevillea Grove Spring Valley, Spring Valley, Nairobi","Jabavu court, Kilimani, Nairobi","Kiambu Road, Kiambu Road",...,"Shanzu, Mombasa","Thika Rd Nairobi, Kahawa Wendani, Nairobi","Vihiga road, Kileleshwa, Nairobi","Waiyaki Way, Westlands","Westlands Area, Westlands","Westlands downtown, Westlands, Nairobi","Westlands, Nairobi","kilimani, Kilimani, Kilimani, Dagoretti North","kilimani, kilimani, Kilimani, Dagoretti North","lavington, Lavington, Lavington, Dagoretti North"
0,"Riverside Dr Nairobi, Riverside, Nairobi",3.0,3.0,200000,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,"Riverside Dr Nairobi, Riverside, Nairobi",3.0,3.0,200000,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,"Riverside Dr Nairobi, Riverside, Nairobi",3.0,3.0,200000,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,"Riverside Dr Nairobi, Riverside, Nairobi",3.0,3.0,200000,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,"Riverside Dr Nairobi, Riverside, Nairobi",3.0,3.0,200000,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [84]:
df_new3 = df_new2.drop('location', axis='columns')
df_new3.head(2)

,bedrooms,bathrooms,price,"Brookside, Westlands","General Mathenge, General Mathenge, Westlands","General Mathenge, Westlands","Grevillea Grove Spring Valley, Spring Valley, Nairobi","Jabavu court, Kilimani, Nairobi","Kiambu Road, Kiambu Road","Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu",...,"Shanzu, Mombasa","Thika Rd Nairobi, Kahawa Wendani, Nairobi","Vihiga road, Kileleshwa, Nairobi","Waiyaki Way, Westlands","Westlands Area, Westlands","Westlands downtown, Westlands, Nairobi","Westlands, Nairobi","kilimani, Kilimani, Kilimani, Dagoretti North","kilimani, kilimani, Kilimani, Dagoretti North","lavington, Lavington, Lavington, Dagoretti North"
0,3.0,3.0,200000,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,3.0,3.0,200000,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [85]:
df_new3.shape

(3701, 41)

In [86]:
x = df_new3.drop('price',axis='columns')
x.head()

,bedrooms,bathrooms,"Brookside, Westlands","General Mathenge, General Mathenge, Westlands","General Mathenge, Westlands","Grevillea Grove Spring Valley, Spring Valley, Nairobi","Jabavu court, Kilimani, Nairobi","Kiambu Road, Kiambu Road","Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu","Kileleshwa Nairobi, Kileleshwa, Nairobi",...,"Shanzu, Mombasa","Thika Rd Nairobi, Kahawa Wendani, Nairobi","Vihiga road, Kileleshwa, Nairobi","Waiyaki Way, Westlands","Westlands Area, Westlands","Westlands downtown, Westlands, Nairobi","Westlands, Nairobi","kilimani, Kilimani, Kilimani, Dagoretti North","kilimani, kilimani, Kilimani, Dagoretti North","lavington, Lavington, Lavington, Dagoretti North"
0,3.0,3.0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,3.0,3.0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3.0,3.0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,3.0,3.0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,3.0,3.0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [87]:
y = df_new3.price
y.head()

0    200000
1    200000
2    200000
3    200000
4    200000
Name: price, dtype: int64

In [88]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=0.2, random_state=0)

In [89]:
from sklearn.linear_model import LinearRegression
lr_clf = LinearRegression()
lr_clf.fit(x_train, y_train)
lr_clf.score(x_test, y_test)

0.8239803890634534

In [90]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score

cv = ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)
cross_val_score(LinearRegression(), x, y, cv=cv)

array([0.82398039, 0.8280293 , 0.8325729 , 0.8322638 , 0.82478481])

In [91]:
from sklearn.model_selection import GridSearchCV
from sklearn.linear_model import Lasso
from sklearn.tree import DecisionTreeRegressor

def find_best_model_using_gridsearchcv(x,y):
    algos={
        'linear_regression':{
            'model':LinearRegression(),
            'params':{
                'normalize':[True, False]
            }
        },
        'lasso':{
            'model':Lasso(),
            'params':{
                'alpha':[1,2],
                'selection':['random','cyclic']
            }
        },
        'decision_tree':{
            'model':DecisionTreeRegressor(),
            'params':{
                'criterion':['mse','friedman_mse'],
                'splitter':['best','random']
            }
        }
    }
    
    scores=[]
    cv=ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)
    for algo_name, config in algos.items():
        gs=GridSearchCV(config['model'], config['params'], cv=cv, return_train_score=False)
        gs.fit(x,y)
        scores.append({
            'model':algo_name,
            'best_score':gs.best_score_,
            'best_params':gs.best_params_
        })
        
    return pd.DataFrame(scores, columns=['model','best_score','best_params'])

find_best_model_using_gridsearchcv(x,y)

               model  best_score                                 best_params
0  linear_regression    0.828326                         {'normalize': True}
1              lasso    0.828334         {'alpha': 2, 'selection': 'cyclic'}
2      decision_tree    0.865784  {'criterion': 'mse', 'splitter': 'random'}

In [92]:
x.columns

Index(['bedrooms', 'bathrooms', 'Brookside, Westlands',
       'General Mathenge, General Mathenge, Westlands',
       'General Mathenge, Westlands',
       'Grevillea Grove Spring Valley, Spring Valley, Nairobi',
       'Jabavu court, Kilimani, Nairobi', 'Kiambu Road, Kiambu Road',
       'Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu',
       'Kileleshwa Nairobi, Kileleshwa, Nairobi',
       'Kileleshwa, Dagoretti North', 'Kileleshwa, Nairobi',
       'Kilimani, Dagoretti North', 'Kilimani, Nairobi',
       'Lavington, Dagoretti North', 'Limuru Road, Ruaka, Kiambaa',
       'Links Rd Mombasa, Nyali, Mombasa', 'Muthaiga, Nairobi',
       'Near Valley Arcade, Lavington, Nairobi', 'Ngong Road, Ngong Road',
       'Nyali, Mombasa', 'Off Othaya road, Lavington, Nairobi',
       'Parklands, Westlands', 'Rhapta Road, Westlands',
       'Rhapta Road, Westlands Area, Westlands', 'Riara Road, Dagoretti North',
       'Riverside Dr Nairobi, Riverside, Nairobi',
       'Riverside Drive, Riverside, Westlands', 'Riverside, Westlands',
       'Ruaka, Kiambaa', 'Shanzu, Mombasa',
       'Thika Rd Nairobi, Kahawa Wendani, Nairobi',
       'Vihiga road, Kileleshwa, Nairobi', 'Waiyaki Way, Westlands',
       'Westlands Area, Westlands', 'Westlands downtown, Westlands, Nairobi',
       'Westlands, Nairobi', 'kilimani, Kilimani, Kilimani, Dagoretti North',
       'kilimani, kilimani, Kilimani, Dagoretti North',
       'lavington, Lavington, Lavington, Dagoretti North'],
      dtype='object')

In [93]:
np.where(x.columns == 'Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu')[0][0]

8

In [94]:
def predict_price(location, bathrooms, bedrooms):
    loc_index = np.where(x.columns == location)[0][0]
    X = np.zeros(len(x.columns))
    X[0] = bedrooms
    X[1] = bathrooms
    if loc_index >= 0:
        X[loc_index] = 1
    return lr_clf.predict([X])[0]

In [95]:
predict_price('Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu',2,2)

42215.804854852715

In [96]:
import pickle
with open('nairobi_home_prices_model2.pickle','wb') as f:
    pickle.dump(lr_clf, f)

In [97]:
import json
columns={
    'data_columns':[col.lower() for col in x.columns]
}

with open("columns.json","w") as f:
    f.write(json.dumps(columns))